In [68]:
import pandas as pd
filename = 'C:\\Users\\Admin\\Documents\\Contact.xlsx'
df = pd.read_excel(filename)

In [69]:
df.head(5)

,Company Name,Contact Name,Designation,Email,Phone,Size
0,Shuttl,Amit Singh,Cofounder,amit.singh@shuttl.com,NaN,251-500
1,Shuttl,Deepanshu Malviya,Cofounder,deepanshu.malviya@shuttl.com,NaN,251-500
2,Shuttl,Gaurav Jain,VP Product,gaurav.jain@shuttl.com,NaN,251-500
3,Shuttl,Kashif Razzaqui,CTO,kashif.r@shuttl.com,NaN,251-500
4,Shuttl,Ramashis Biswas,Head HR,ramashis.biswas@shuttl.com,NaN,251-500

In [70]:
df = pd.DataFrame(df)

In [71]:
df = df.drop_duplicates(subset='Email', keep='first')

In [72]:
#df = df.set_index(['Company', 'name', 'Designation', 'Email', 'Location', 'Region', 'DB', 'Week', 'Person Status'])

In [73]:
df.shape

(26438, 6)

In [74]:
df.columns

Index(['Company Name', 'Contact Name', 'Designation', 'Email', 'Phone',
       'Size'],
      dtype='object')

In [75]:
#df = df.drop(['Unnamed: 0'], axis=1)

In [76]:
df.head(5)

,Company Name,Contact Name,Designation,Email,Phone,Size
0,Shuttl,Amit Singh,Cofounder,amit.singh@shuttl.com,NaN,251-500
1,Shuttl,Deepanshu Malviya,Cofounder,deepanshu.malviya@shuttl.com,NaN,251-500
2,Shuttl,Gaurav Jain,VP Product,gaurav.jain@shuttl.com,NaN,251-500
3,Shuttl,Kashif Razzaqui,CTO,kashif.r@shuttl.com,NaN,251-500
4,Shuttl,Ramashis Biswas,Head HR,ramashis.biswas@shuttl.com,NaN,251-500

In [77]:
Filename = 'C:\\Users\\Admin\\Company.csv'
data = pd.read_csv(Filename)

In [78]:
data.shape, df.shape

((12948, 10), (26438, 6))

In [79]:
data = pd.DataFrame(data)

In [80]:
data = data[['Company', 'id_co',]]
data.head()

           Company id_co
0           Shuttl  SNX0
1  Digit Insurance  DBX1
2           Swiggy  SBX2
3       Cleardekho  CNX3
4           Zomato  ZNX4

In [81]:
# df['id'] =  np.random.normal(size=len(df))
df.head(1)

In [82]:
# df[df["Company"] == ["Shuttl"]["id"] = 0

In [83]:
x = df.merge(data, left_on='Company Name', right_on='Company')
x.shape

(26643, 8)

In [84]:
#df_1= df.drop(['Unnamed: 11', 'Unnamed: 0'], axis = 1)
x.head()

,Company Name,Contact Name,Designation,Email,Phone,Size,Company,id_co
0,Shuttl,Amit Singh,Cofounder,amit.singh@shuttl.com,NaN,251-500,Shuttl,SNX0
1,Shuttl,Deepanshu Malviya,Cofounder,deepanshu.malviya@shuttl.com,NaN,251-500,Shuttl,SNX0
2,Shuttl,Gaurav Jain,VP Product,gaurav.jain@shuttl.com,NaN,251-500,Shuttl,SNX0
3,Shuttl,Kashif Razzaqui,CTO,kashif.r@shuttl.com,NaN,251-500,Shuttl,SNX0
4,Shuttl,Ramashis Biswas,Head HR,ramashis.biswas@shuttl.com,NaN,251-500,Shuttl,SNX0

In [85]:
df = x.drop(['Company'], axis = 1)

In [86]:
filename = 'C:\\Users\\Admin\\Documents\\Contact.xlsx'

In [87]:
df.to_excel(filename)

In [88]:
x = pd.read_excel(filename)

In [89]:
x['Contact Name'][0][0]+x['Company Name'][0] + str(1)

'AShuttl1'

In [90]:
x.fillna('X', inplace = True)
x.head()

,Unnamed: 0,Company Name,Contact Name,Designation,Email,Phone,Size,id_co
0,0,Shuttl,Amit Singh,Cofounder,amit.singh@shuttl.com,X,251-500,SNX0
1,1,Shuttl,Deepanshu Malviya,Cofounder,deepanshu.malviya@shuttl.com,X,251-500,SNX0
2,2,Shuttl,Gaurav Jain,VP Product,gaurav.jain@shuttl.com,X,251-500,SNX0
3,3,Shuttl,Kashif Razzaqui,CTO,kashif.r@shuttl.com,X,251-500,SNX0
4,4,Shuttl,Ramashis Biswas,Head HR,ramashis.biswas@shuttl.com,X,251-500,SNX0

In [91]:
x['id_con']=""

In [93]:
for value in range(0, len(x['Email'])):
    x['id_con'][value] = str(x['Contact Name'][value])[0] + str(x['id_co'][value]) + str([value])

C:\Users\Admin\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [94]:
#x.rename(columns={'Unnamed: 0' : 'id_con'}, inplace = True)
x.head()

,Unnamed: 0,Company Name,Contact Name,Designation,Email,Phone,Size,id_co,id_con
0,0,Shuttl,Amit Singh,Cofounder,amit.singh@shuttl.com,X,251-500,SNX0,ASNX0[0]
1,1,Shuttl,Deepanshu Malviya,Cofounder,deepanshu.malviya@shuttl.com,X,251-500,SNX0,DSNX0[1]
2,2,Shuttl,Gaurav Jain,VP Product,gaurav.jain@shuttl.com,X,251-500,SNX0,GSNX0[2]
3,3,Shuttl,Kashif Razzaqui,CTO,kashif.r@shuttl.com,X,251-500,SNX0,KSNX0[3]
4,4,Shuttl,Ramashis Biswas,Head HR,ramashis.biswas@shuttl.com,X,251-500,SNX0,RSNX0[4]

In [95]:
df = x.drop(['Unnamed: 0'], axis = 1)

In [96]:
#df = df.set_index(['id_co', 'Company', 'id_con', 'name', 'Designation', 'Email', 'Location', 'Region', 'DB', 'Week'])

In [97]:
df.head()

,Company Name,Contact Name,Designation,Email,Phone,Size,id_co,id_con
0,Shuttl,Amit Singh,Cofounder,amit.singh@shuttl.com,X,251-500,SNX0,ASNX0[0]
1,Shuttl,Deepanshu Malviya,Cofounder,deepanshu.malviya@shuttl.com,X,251-500,SNX0,DSNX0[1]
2,Shuttl,Gaurav Jain,VP Product,gaurav.jain@shuttl.com,X,251-500,SNX0,GSNX0[2]
3,Shuttl,Kashif Razzaqui,CTO,kashif.r@shuttl.com,X,251-500,SNX0,KSNX0[3]
4,Shuttl,Ramashis Biswas,Head HR,ramashis.biswas@shuttl.com,X,251-500,SNX0,RSNX0[4]

In [98]:
Filename1='C:\\Users\\Admin\\Contact.csv'

In [99]:
Contact = df.to_csv(Filename1)